
//=============================================================================
//	@file	Chapter1_02.h
//	@brief	第1章 [2項] :: #definより、const,enum,inline を使おう
//	@autor	Takuya Ochi
//	@date	2019/05/23
//=============================================================================

//-----------------------------------------------------------------------------
//	@brief	プリプロセッサ
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
//	@brief	第1章 [2項] :: #definより、 const,enum,inline を使おう
//-----------------------------------------------------------------------------
class Chapter1_02 final
{
public:



private:

	//	配列で使用する値として
	//	staticなクラス定数の宣言
	static const int	ArrayNum = 10;				//	定数宣言
	int					m_array[ArrayNum];			//	配列で使用

	//	ここでは値は未定義
	//	値はソースファイルに書きます。
	static const float	Constant;					//	staticなクラス定数の宣言


	//	定数の代わりに、
	//	enumハックを使おう
	enum			{ NumTurns = 10 };				//	enumハック
	int				m_array2[NumTurns];				//	NumTurnsを10の代わりに使う
 
};
