
//=============================================================================
//	@file	Chapter1_03.h
//	@brief	第1章 [3項] :: 可能なら、constを使おう
//	@autor	Takuya Ochi
//	@date	2019/05/24
//=============================================================================

//-----------------------------------------------------------------------------
//	@brief	プリプロセッサ
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
//	@brief	第1章 [3項] :: 可能なら、constを使おう
//-----------------------------------------------------------------------------
class Chapter1_03 final
{
public:

private:

	enum { DataNum = 5 };
	char m_data[DataNum];

	//	ポインタは非const
	//	データは非const
	char*				m_pData = m_data;

	//	ポインタは非const
	//	データはconst
	const char*			m_pData = m_data;		//	ポインタが指し示すデータは不変

	//	ポインタはconst
	//	データは非const
	char* const			m_pData = m_data;		//	ポインタそのものが不変

	//	ポインタはconst
	//	データはconst
	const char* const	m_pData = m_data;		//	ポインタもポインタが指し示すデータも不変


	//	constの位置は複数ある
	//	*より左側にconstをつける場合は、
	//	人によって書き方が変わる
	const char*			m_pData;		//	どちらも意味は同じ
	char const*			m_pData;		//	ポインタの指し示すデータは不変

};
